/*
Navicat MySQL Data Transfer

Source Server         : 192.168.33.100_3306
Source Server Version : 50549
Source Host           : 192.168.33.100:3306
Source Database       : xiaobao

Target Server Type    : MYSQL
Target Server Version : 50549
File Encoding         : 65001

Date: 2016-07-19 13:48:04
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for catalogs
-- ----------------------------
DROP TABLE IF EXISTS `catalogs`;
CREATE TABLE `catalogs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) unsigned NOT NULL DEFAULT '0',
  `lft` int(10) NOT NULL,
  `rght` int(10) NOT NULL,
  `name` varchar(100) NOT NULL COMMENT '目录名称',
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of catalogs
-- ----------------------------
INSERT INTO `catalogs` VALUES ('1', '0', '1', '80', '第一部分 保险产品专业知识', '2015-11-04 16:41:48', '2015-11-04 16:41:48');
INSERT INTO `catalogs` VALUES ('2', '0', '81', '166', '\r\n第二部分 金融学及投资理财基础知识', '2015-11-04 16:41:48', '2015-11-04 16:41:48');
INSERT INTO `catalogs` VALUES ('3', '0', '167', '216', '\r\n第三部分 法律法规与职业道德', '2015-11-04 16:41:48', '2015-11-04 16:41:48');
INSERT INTO `catalogs` VALUES ('4', '1', '2', '19', '第一章 人身保险', '2015-11-04 16:58:27', '2015-11-04 16:58:27');
INSERT INTO `catalogs` VALUES ('5', '4', '3', '4', '第一节 人身保险定义和特点', '2015-11-04 17:02:14', '2015-11-04 17:02:14');
INSERT INTO `catalogs` VALUES ('6', '4', '5', '6', '第二节 人身保险的分类', '2015-11-04 17:02:14', '2015-11-04 17:02:14');
INSERT INTO `catalogs` VALUES ('7', '4', '7', '8', '第三节 人身保险的基本原理和适用原则', '2015-11-04 17:02:14', '2015-11-04 17:02:14');
INSERT INTO `catalogs` VALUES ('8', '4', '9', '18', '第四节 人身保险合同', '2015-11-04 17:02:14', '2015-11-04 17:02:14');
INSERT INTO `catalogs` VALUES ('9', '1', '20', '27', '第二章 人身意外伤害保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('10', '1', '28', '35', '第三章 健康保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('11', '1', '36', '41', '第四章 普通人寿保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('12', '1', '42', '49', '第五章 分红保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('13', '1', '50', '57', '第六章 万能保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('14', '1', '58', '69', '第七章 投资连结保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('15', '1', '70', '79', '第八章 变额 年金 保险', '2015-11-04 17:18:01', '2015-11-04 17:18:01');
INSERT INTO `catalogs` VALUES ('16', '9', '21', '22', '第一节 人身意外伤害保险概述', '2015-11-04 17:21:51', '2015-11-04 17:21:51');
INSERT INTO `catalogs` VALUES ('17', '9', '23', '24', '第二节 人身意外伤害保险的分类', '2015-11-04 17:21:51', '2015-11-04 17:21:51');
INSERT INTO `catalogs` VALUES ('18', '9', '25', '26', '第三节 人身意外伤害保险的投保与理赔', '2015-11-04 17:21:51', '2015-11-04 17:21:51');
INSERT INTO `catalogs` VALUES ('19', '10', '29', '30', '第一节 健康保险的定义和特点', '2015-11-04 17:22:38', '2015-11-04 17:22:38');
INSERT INTO `catalogs` VALUES ('20', '10', '31', '32', '第二节 健康保险的分类', '2015-11-04 17:22:38', '2015-11-04 17:22:38');
INSERT INTO `catalogs` VALUES ('21', '10', '33', '34', '第三节 健康保险投保与理赔', '2015-11-04 17:22:38', '2015-11-04 17:22:38');
INSERT INTO `catalogs` VALUES ('22', '11', '37', '38', '第一节 普通人寿保险概述', '2015-11-04 17:22:56', '2015-11-04 17:22:56');
INSERT INTO `catalogs` VALUES ('23', '11', '39', '40', '第二节 普通人寿保险的险种', '2015-11-04 17:22:56', '2015-11-04 17:22:56');
INSERT INTO `catalogs` VALUES ('24', '12', '43', '44', '第一节 分红保险概述', '2015-11-04 17:23:11', '2015-11-04 17:23:11');
INSERT INTO `catalogs` VALUES ('25', '12', '45', '46', '第二节 分红保险的红利分配', '2015-11-04 17:23:11', '2015-11-04 17:23:11');
INSERT INTO `catalogs` VALUES ('26', '12', '47', '48', '第三节 分红保险的销售案例解析', '2015-11-04 17:23:11', '2015-11-04 17:23:11');
INSERT INTO `catalogs` VALUES ('27', '13', '51', '52', '第一节 万能保险概述', '2015-11-04 17:23:34', '2015-11-04 17:23:34');
INSERT INTO `catalogs` VALUES ('28', '13', '53', '54', '第二节 万能保险的产品形态', '2015-11-04 17:23:34', '2015-11-04 17:23:34');
INSERT INTO `catalogs` VALUES ('29', '13', '55', '56', '第三节 万能保险销售案例解析', '2015-11-04 17:23:34', '2015-11-04 17:23:34');
INSERT INTO `catalogs` VALUES ('30', '14', '59', '60', '第一节 投资连结保险的定义和特点', '2015-11-04 17:24:33', '2015-11-04 17:24:33');
INSERT INTO `catalogs` VALUES ('31', '14', '61', '62', '第二节 我国投资连结保险的产品形态', '2015-11-04 17:24:33', '2015-11-04 17:24:33');
INSERT INTO `catalogs` VALUES ('32', '14', '63', '64', '第三节 投资连结保险的投 资账户', '2015-11-04 17:24:33', '2015-11-04 17:24:33');
INSERT INTO `catalogs` VALUES ('33', '14', '65', '66', '第四节 投资连结保险的保单账户', '2015-11-04 17:24:33', '2015-11-04 17:24:33');
INSERT INTO `catalogs` VALUES ('34', '14', '67', '68', '第五节 投资连结保险销售管理', '2015-11-04 17:24:33', '2015-11-04 17:24:33');
INSERT INTO `catalogs` VALUES ('35', '15', '71', '72', '第一节 变额年金保险概述', '2015-11-04 17:25:03', '2015-11-04 17:25:03');
INSERT INTO `catalogs` VALUES ('36', '15', '73', '74', '第二节 我国变额年金保险的产品形态', '2015-11-04 17:25:03', '2015-11-04 17:25:03');
INSERT INTO `catalogs` VALUES ('37', '15', '75', '76', '第三节 变额年金保险的风险与管理', '2015-11-04 17:25:03', '2015-11-04 17:25:03');
INSERT INTO `catalogs` VALUES ('38', '15', '77', '78', '第三节 变额年金保险的风险与管理', '2015-11-04 17:25:03', '2015-11-04 17:25:03');
INSERT INTO `catalogs` VALUES ('39', '2', '82', '91', '第一章 投资理财概述', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('40', '2', '92', '101', '第二章 投资理财的财务基础', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('41', '2', '102', '109', '第三章 个人财务分析', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('42', '2', '110', '119', '第四章 现金规划与银行理财', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('43', '2', '120', '125', '第五章 股票投资', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('44', '2', '126', '131', '第六章 债券投资', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('45', '2', '132', '141', '第七章 证券投资基金理财', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('46', '2', '142', '147', '第八章 保险理财', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('47', '2', '148', '153', '第九章 税务筹划', '2015-11-05 03:09:06', '2015-11-05 03:09:06');
INSERT INTO `catalogs` VALUES ('48', '2', '154', '159', '第十章 退休与遗产规划', '2015-11-05 03:09:54', '2015-11-05 03:09:54');
INSERT INTO `catalogs` VALUES ('49', '2', '160', '165', '第十一章 综合投资理财的设计与规划', '2015-11-05 03:09:54', '2015-11-05 03:09:54');
INSERT INTO `catalogs` VALUES ('50', '39', '83', '84', '第一节 投资理财的含义', '2015-11-05 03:13:06', '2015-11-05 03:13:06');
INSERT INTO `catalogs` VALUES ('51', '39', '85', '86', '第二节 投资理财的主要工具', '2015-11-05 03:13:06', '2015-11-05 03:13:06');
INSERT INTO `catalogs` VALUES ('52', '39', '87', '88', '第三节 投资理财的人生规划', '2015-11-05 03:13:06', '2015-11-05 03:13:06');
INSERT INTO `catalogs` VALUES ('53', '39', '89', '90', '第四节 投资理财市场的现状与发展', '2015-11-05 03:13:06', '2015-11-05 03:13:06');
INSERT INTO `catalogs` VALUES ('54', '40', '93', '94', '第一节 生命周期理论', '2015-11-05 03:13:23', '2015-11-05 03:13:23');
INSERT INTO `catalogs` VALUES ('55', '40', '95', '96', '第二节 持久收入消费理论', '2015-11-05 03:13:23', '2015-11-05 03:13:23');
INSERT INTO `catalogs` VALUES ('56', '40', '97', '98', '第三节 货币的时间价值', '2015-11-05 03:13:23', '2015-11-05 03:13:23');
INSERT INTO `catalogs` VALUES ('57', '40', '99', '100', '第四节 风险的计量与管理', '2015-11-05 03:13:23', '2015-11-05 03:13:23');
INSERT INTO `catalogs` VALUES ('58', '41', '103', '104', '第一节 财务分析的概念', '2015-11-05 03:14:11', '2015-11-05 03:14:11');
INSERT INTO `catalogs` VALUES ('59', '41', '105', '106', '第二节 个人资产负债表的编制与分析', '2015-11-05 03:14:11', '2015-11-05 03:14:11');
INSERT INTO `catalogs` VALUES ('60', '41', '107', '108', '第三节 家庭现金流量表的编制与分析', '2015-11-05 03:14:11', '2015-11-05 03:14:11');
INSERT INTO `catalogs` VALUES ('61', '42', '111', '112', '第一节 现金规划', '2015-11-05 03:14:32', '2015-11-05 03:14:32');
INSERT INTO `catalogs` VALUES ('62', '42', '113', '114', '第二节 银行储蓄产品', '2015-11-05 03:14:32', '2015-11-05 03:14:32');
INSERT INTO `catalogs` VALUES ('63', '42', '115', '116', '第三节 银行卡', '2015-11-05 03:14:32', '2015-11-05 03:14:32');
INSERT INTO `catalogs` VALUES ('64', '42', '117', '118', '第四节 银行融资产品', '2015-11-05 03:14:32', '2015-11-05 03:14:32');
INSERT INTO `catalogs` VALUES ('65', '43', '121', '122', '第一节 股票概述', '2015-11-05 03:14:52', '2015-11-05 03:14:52');
INSERT INTO `catalogs` VALUES ('66', '43', '123', '124', '第二节 股票投资风险和收益', '2015-11-05 03:14:52', '2015-11-05 03:14:52');
INSERT INTO `catalogs` VALUES ('67', '44', '127', '128', '第一节 债券的概念及种类', '2015-11-05 03:15:12', '2015-11-05 03:15:12');
INSERT INTO `catalogs` VALUES ('68', '44', '129', '130', '第二节 债券投资收益分析', '2015-11-05 03:15:12', '2015-11-05 03:15:12');
INSERT INTO `catalogs` VALUES ('69', '45', '133', '134', '第一节 证券投资基金的基础知识', '2015-11-05 03:15:34', '2015-11-05 03:15:34');
INSERT INTO `catalogs` VALUES ('70', '45', '135', '136', '第二节 基金的价格确定', '2015-11-05 03:15:34', '2015-11-05 03:15:34');
INSERT INTO `catalogs` VALUES ('71', '45', '137', '138', '第三节 基金的收益和费用', '2015-11-05 03:15:34', '2015-11-05 03:15:34');
INSERT INTO `catalogs` VALUES ('72', '45', '139', '140', '第四节 基金理财的技巧与绩效评估', '2015-11-05 03:15:34', '2015-11-05 03:15:34');
INSERT INTO `catalogs` VALUES ('73', '46', '143', '144', '第一节 保险基础知识', '2015-11-05 03:16:57', '2015-11-05 03:16:57');
INSERT INTO `catalogs` VALUES ('74', '46', '145', '146', '第二节 制订保险投资理财计划', '2015-11-05 03:16:57', '2015-11-05 03:16:57');
INSERT INTO `catalogs` VALUES ('75', '47', '149', '150', '第一节 税务筹划概述', '2015-11-05 03:22:27', '2015-11-05 03:22:27');
INSERT INTO `catalogs` VALUES ('76', '47', '151', '152', '第二节 税务筹划策略与技巧', '2015-11-05 03:22:27', '2015-11-05 03:22:27');
INSERT INTO `catalogs` VALUES ('77', '48', '155', '156', '第一节 退休规划', '2015-11-05 03:22:48', '2015-11-05 03:22:48');
INSERT INTO `catalogs` VALUES ('78', '48', '157', '158', '第二节 遗产规划', '2015-11-05 03:22:48', '2015-11-05 03:22:48');
INSERT INTO `catalogs` VALUES ('79', '49', '161', '162', '第一节 客户财务分析报告', '2015-11-05 03:23:30', '2015-11-05 03:23:30');
INSERT INTO `catalogs` VALUES ('80', '49', '163', '164', '第二节 制订各分项投资理财规划具体方案的步骤', '2015-11-05 03:23:31', '2015-11-05 03:23:31');
INSERT INTO `catalogs` VALUES ('81', '3', '168', '177', '第一章 保险法律责任', '2015-11-05 03:41:07', '2015-11-05 03:41:07');
INSERT INTO `catalogs` VALUES ('82', '3', '178', '185', '第二章 保险消费者权益保护', '2015-11-05 03:41:07', '2015-11-05 03:41:07');
INSERT INTO `catalogs` VALUES ('83', '3', '186', '201', '第三章 中华人民共和国保险法', '2015-11-05 03:41:07', '2015-11-05 03:41:07');
INSERT INTO `catalogs` VALUES ('84', '3', '202', '209', '第四章 北京地区人身保险相关法规制度', '2015-11-05 03:41:07', '2015-11-05 03:41:07');
INSERT INTO `catalogs` VALUES ('85', '3', '210', '215', '第五章 职业道德', '2015-11-05 03:41:07', '2015-11-05 03:41:07');
INSERT INTO `catalogs` VALUES ('86', '81', '169', '170', '第一节 法律责任概述', '2015-11-05 03:41:35', '2015-11-05 03:41:35');
INSERT INTO `catalogs` VALUES ('87', '81', '171', '172', '第二节 保险民事法律责任', '2015-11-05 03:41:35', '2015-11-05 03:41:35');
INSERT INTO `catalogs` VALUES ('88', '81', '173', '174', '第三节 保险行政法律责任', '2015-11-05 03:41:35', '2015-11-05 03:41:35');
INSERT INTO `catalogs` VALUES ('89', '81', '175', '176', '第四节 保险刑事法律责任', '2015-11-05 03:41:36', '2015-11-05 03:41:36');
INSERT INTO `catalogs` VALUES ('90', '82', '179', '180', '第一节 人身保险投保提示工作要求', '2015-11-05 03:41:50', '2015-11-05 03:41:50');
INSERT INTO `catalogs` VALUES ('91', '82', '181', '182', '第二节 人身保险产品信息披露管理', '2015-11-05 03:41:50', '2015-11-05 03:41:50');
INSERT INTO `catalogs` VALUES ('92', '82', '183', '184', '第三节 人身保险销售误导行为治理', '2015-11-05 03:41:50', '2015-11-05 03:41:50');
INSERT INTO `catalogs` VALUES ('93', '83', '187', '188', '第一节 总则', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('94', '83', '189', '190', '第二节 保险合同', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('95', '83', '191', '192', '第三节 保险公司', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('96', '83', '193', '194', '第四节 保险经营规则', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('97', '83', '195', '196', '第五节 保险代理人和保险经纪人', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('98', '83', '197', '198', '第六节 保险业监督管理', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('99', '83', '199', '200', '第七节 法律责任', '2015-11-05 03:42:10', '2015-11-05 03:42:10');
INSERT INTO `catalogs` VALUES ('100', '84', '203', '204', '第一节 北京地区新单回访问题件管理办法', '2015-11-05 03:42:32', '2015-11-05 03:42:32');
INSERT INTO `catalogs` VALUES ('101', '84', '205', '206', '第二节 北京地区保险销售强调语及新单回访基础用语', '2015-11-05 03:42:32', '2015-11-05 03:42:32');
INSERT INTO `catalogs` VALUES ('102', '84', '207', '208', '第三节 北京地区人身保险经营行为管理办法', '2015-11-05 03:42:32', '2015-11-05 03:42:32');
INSERT INTO `catalogs` VALUES ('103', '85', '211', '212', '第一节 保险销售从业人员职业道德概述', '2015-11-05 03:42:50', '2015-11-05 03:42:50');
INSERT INTO `catalogs` VALUES ('104', '85', '213', '214', '第二节 保险 销售从业人员的监督管理', '2015-11-05 03:42:50', '2015-11-05 03:42:50');
INSERT INTO `catalogs` VALUES ('105', '0', '217', '228', '基础会计', '2015-11-10 02:00:30', '2015-11-10 02:00:30');
INSERT INTO `catalogs` VALUES ('106', '105', '218', '219', '1', '2015-11-10 02:01:05', '2015-11-10 02:01:05');
INSERT INTO `catalogs` VALUES ('107', '105', '220', '221', '2-33', '2015-11-10 02:01:05', '2015-11-10 02:01:05');
INSERT INTO `catalogs` VALUES ('108', '105', '222', '223', '3', '2015-11-10 02:01:05', '2015-11-10 02:01:05');
INSERT INTO `catalogs` VALUES ('109', '105', '224', '225', '4', '2015-11-10 02:01:05', '2015-11-10 02:01:05');
INSERT INTO `catalogs` VALUES ('110', '105', '226', '227', '5', '2015-11-10 02:01:05', '2015-11-10 02:01:05');

-- ----------------------------
-- Table structure for roles
-- ----------------------------
DROP TABLE IF EXISTS `roles`;
CREATE TABLE `roles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '0',
  `login_redirect` varchar(256) DEFAULT '',
  `created` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `modified` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of roles
-- ----------------------------
INSERT INTO `roles` VALUES ('1', 'administrator', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00');
INSERT INTO `roles` VALUES ('2', 'manager', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00');
INSERT INTO `roles` VALUES ('3', 'user', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00');

-- ----------------------------
-- Table structure for subjects
-- ----------------------------
DROP TABLE IF EXISTS `subjects`;
CREATE TABLE `subjects` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `catalog_id` int(11) unsigned DEFAULT '0' COMMENT '目录ID',
  `type` tinyint(4) unsigned DEFAULT '1' COMMENT '题型',
  `title` varchar(255) DEFAULT '' COMMENT '题目',
  `body` varchar(500) DEFAULT '' COMMENT '内容',
  `answer` varchar(10) DEFAULT '' COMMENT '答案:判断题：0，错；1，对\r\n',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of subjects
-- ----------------------------
INSERT INTO `subjects` VALUES ('1', '5', '1', '以人的寿命和身体为保险标的的保险称为 （ ）。', 'A ： 人寿保险 ###B ： 健康保险 ###C ： 人身意外伤害保险 ###D ： 人身保险', 'd', '2015-11-05 07:26:17', '2015-11-05 08:15:30');
INSERT INTO `subjects` VALUES ('2', '5', '1', '关于人身保险的作用 ， 下列说 法错误的是 （ ） 。', 'A ： 能够完全补偿被保险人的所有利益损失 ###B ： 是一种社会保障手段 ###C ： 能缓解被保险人的经济困难 ###D ： 是一种资金融通手段', 'a', '2015-11-05 08:10:22', '2015-11-05 08:14:49');
INSERT INTO `subjects` VALUES ('3', '5', '1', '当以 人的 （ ） 作为人 身保险的 保险标的 时 ， 主 要是针 对人的生存 或死亡的两种状态 。', 'A ： 健康###B ： 寿命###C ： 身体 ###D ： 年龄', 'b', '2015-11-05 10:12:12', '2015-11-05 10:12:12');
INSERT INTO `subjects` VALUES ('4', '5', '1', '当以人的 （ ） 作为人身保险的保险标的时 ， 主要是针对人的健康 、 生理机能及劳动能力等状态 。', 'A ： 健康 ###B ： 寿命 ###C ： 身体 ###D ： 年龄', 'c', '2015-11-05 13:17:15', '2015-11-05 13:17:15');
INSERT INTO `subjects` VALUES ('5', '5', '1', '人身 保险中 的 （ ） 不 仅可采用 定额给付 方式 ， 也可以 采用损失补 偿方式 。', 'A ： 生死两全保险 ###B ： 死亡保险 ###C ： 生存保险 ###D ： 医疗保险', 'd', '2015-11-05 13:19:49', '2015-11-05 13:19:49');
INSERT INTO `subjects` VALUES ('6', '5', '1', '关于医疗保险的给付方式 ， 下列说法正确的是 （ ） 。', 'A ： 可采用定额给付方式 ###B ： 是人身保险的例外 ， 仅采用费用补偿方式 ###C ： 不适用费用补偿原则###D ： 生命无价 ， 额度不能设限', 'a', '2015-11-05 13:23:52', '2015-11-05 13:23:52');
INSERT INTO `subjects` VALUES ('7', '5', '1', ' 与财产保险相比 ， 人身保险的主要特点不包括 （ ） 。 ', 'A ： 人身保险是一种不定额保险###B ： 人身保险是给付性 保险###C ： 人身保险具有储蓄性 ###D ： 人身保险保险期限具有长期性', 'a', '2015-11-05 13:25:02', '2015-11-05 13:25:02');
INSERT INTO `subjects` VALUES ('8', '5', '1', '关于医疗保险的给付方式 ， 下列说法正确的是 （ ） 。', 'A ： 可采用定额给付方式 ###B ： 是人身保险的例外 ， 仅采用费用补偿方式 ###C ： 不适用费用补偿原则 ###D ： 生命无价 ， 额度不能设限 ', 'a', '2015-11-05 14:20:04', '2015-11-05 14:20:04');
INSERT INTO `subjects` VALUES ('9', '5', '1', '与财产保险相比 ， 人身保险的主要特点不包括 （ ） 。 ', 'A ： 人身保险是一种不定额保险 ###B ： 人身保险是给付性 保险 ###C ： 人身保险具有储蓄性 ###D ： 人身保险保险期限具有长期性 ', 'a', '2015-11-05 14:23:32', '2015-11-05 14:23:32');
INSERT INTO `subjects` VALUES ('10', '5', '1', '针对人身保险的特点 ， 下列说法中错误的是 （ ） 。 ', 'A ： 由于人身保险的长期性 ， 保险公司可以积累大量的长期可使用资金 ， 成为资 本市场上重要的机构投资者 ###B ： 投保人所交纳的保 险费 ， 最终都不会按合同约定的形式返还给被保险人或其 受益人 ###C ： 大多不以被保险人遭受实际损失为前提 ， 也并不考虑被保险人是否已通过其 它途径得到补偿 ###D ： 人身保险特别是人寿保险的保险期限一般具有长期性 ， 可以持续几年 、 几十 年甚至终身 ', 'b', '2015-11-05 14:23:59', '2015-11-05 14:23:59');
INSERT INTO `subjects` VALUES ('11', '5', '1', '关于人身保险金额的确定或者赔付的说法中 ， 不正确的是 （ ） 。 ', 'A ： 先用金钱来衡量人身价值 ， 然后再根据价值的大小来确定保险金额 ###B ： 在保险产品精算设 计的基础上确定的金额 ###C ： 大多不以被保险人遭受实际损失为前提 ， 也并不考虑被保险人是否已通过其 它途径得到补偿 ###D ： 在确定金额的同时需要考虑被保险人对人身保险的实际需要程度和投保人实 际交费能力的情况 ', 'a', '2015-11-05 14:24:33', '2015-11-05 14:24:33');
INSERT INTO `subjects` VALUES ('12', '5', '1', '人身保险的保险利益具有特殊性 ， 下列选项中不属于其特殊性的是（ ） 。 ', 'A ： 人身保险的保险利 益产生于人与人之间 ###B ： 人身保险的保险事 故发生时 ， 投保人对被保险人应当具有保险利益 ###C ： 作为保险标的的人的寿命和身体不可用金钱来衡量 ###D ： 在考量人身保险的保险利益时主要考虑投保人保险利益的有无 ', 'b', '2015-11-05 14:25:34', '2015-11-05 14:25:34');
INSERT INTO `subjects` VALUES ('13', '5', '1', '在国际上通常将介于寿险和财险之间的一类保险定义为 “ 第三领域保 险 ” ， 下列属于此领域的保险是 （ ） 。 ', 'A ： 分红保险 ###B ： 投资连结保险 ###C ： 两全保险 ###D ： 人身意外伤害保险', 'd', '2015-11-05 14:26:30', '2015-11-05 14:26:30');
INSERT INTO `subjects` VALUES ('14', '5', '1', '在国际上通常将介于寿险和财险之间的一类保险定义为 “ 第三领域保 险 ” ， 下列属于此领域的保险是 （ ） 。 ', 'A ： 分红保险 ###B ： 投资连结保险 ###C ： 两全保险 ###D ： 人身意外伤害保险', 'd', '2015-11-05 14:26:31', '2015-11-05 14:26:31');
INSERT INTO `subjects` VALUES ('15', '5', '1', '在国际上通常将介于寿险和财险之间的一类保险定义为 “ 第三领域保 险 ” ， 下列属于此领域的保险是 （ ） 。', 'A ： 两全保险 ###B ： 失能保险 ###C ： 短期健康保险 ###D ： 新型人寿保险 ', 'c', '2015-11-05 14:26:59', '2015-11-05 14:26:59');
INSERT INTO `subjects` VALUES ('16', '5', '1', '在我国 ， 理论上虽然将保险业务分为财产保险业务和人身保险业务 ， 但在保险实践中 ， 财产保险公司可以按规定经营 （ ） 。 ', 'A ： 短期健康保险业务 ###B ： 重大疾病保险业务 ###C ： 新型人身保险业务 ###D ： 普通人寿保险业务 ', 'a', '2015-11-05 14:27:24', '2015-11-05 14:27:24');
INSERT INTO `subjects` VALUES ('17', '5', '1', '在我国 ， 理论上虽然将保险业务分为财产保险业务和人身保险业务 ， 但在保险实践中 ， 财产保险公司可以按规定经营 （ ） 。 ', 'A ： 人身意外伤害保险业务 ###B ： 重大疾病保险业务###C ： 新型人身保险业务###D ： 普通人寿保险业务 ', 'a', '2015-11-05 14:27:58', '2015-11-05 14:27:58');
INSERT INTO `subjects` VALUES ('18', '5', '2', '人身保险是以人的 （ ） 为保险标的的保险 。 ', 'A ： 寿命###B ： 身体###C ： 生存###D ： 死亡 ', 'ab', '2015-11-05 14:42:19', '2015-11-05 14:42:19');
INSERT INTO `subjects` VALUES ('19', '5', '2', '人身保险是当被保险人满足（ ）等条件 时保险 人承担 向被保险人 或受益人给付保险金责任的商业保险行为 。', 'A ： 死亡 ###B ： 伤残 ###C ： 疾病 ###D ： 财产受到损失', 'abc', '2015-11-05 14:43:00', '2015-11-05 14:43:00');
INSERT INTO `subjects` VALUES ('20', '5', '2', '人身保险的保险责任包括 （ ） 。', 'A ： 死亡 ###B ： 生存 ###C ： 疾病 ###D ： 意外伤害 ', 'abcd', '2015-11-05 14:43:33', '2015-11-05 14:43:33');
INSERT INTO `subjects` VALUES ('21', '5', '2', '下列 （ ） 属于人身保险的保险责任 。 ', 'A ： 在年老退休之时 ， 给付被保险人或其受益人保险金 ###B ： 被保险人生存至保 险期满 ###C ： 被保险人因遭受交通事故导致车辆受损 ###D ： 被保险人因疾病导致身亡 ', 'abd', '2015-11-05 14:44:05', '2015-11-05 14:44:05');
INSERT INTO `subjects` VALUES ('22', '5', '2', '下列关于医疗保险的说法 ， 正确的是 （ ） 。 ', 'A ： 一般属于定值保险 ###B ： 适用损失补偿原则 ###C ： 属于人身保险种类之一 ###D ： 以被保险人实际支付的医疗费用为限 ', 'bcd', '2015-11-05 14:44:35', '2015-11-05 14:44:35');
INSERT INTO `subjects` VALUES ('23', '5', '2', '相对于财产保险 ， 人身保险利益的特殊性主要体现在 （ ） 。 ', 'A ： 保险利益产生于人与人之间 ###B ： 保险事故发生时 ， 投保人对被保险人应当具有保险利益 ###C ： 保险利益不应作以定量上的规范 ###D ： 考量人身保险的保险利益时主要考虑投保人保险利益的有无 ', 'acd', '2015-11-05 14:47:11', '2015-11-05 14:47:11');
INSERT INTO `subjects` VALUES ('24', '5', '2', '在实务中 ， 人身保险的保险金额是由投保人和保险人双方约定后确定 的 ， 一般从 （ ） 方面来考虑 。 ', 'A ： 保险人的投资能力 ###B ： 投保人交纳保费的能力 ###C ： 投保险种的推出年限 ###D ： 被保险人对人身保险需要的程度 ', 'bd', '2015-11-05 14:47:50', '2015-11-05 14:47:50');
INSERT INTO `subjects` VALUES ('25', '5', '2', '跟财产保险相比 ， 人身保险具有的特点包括 （ ） 。 ', 'A ： 人身保险是一种定额保险 ###B ： 人身保险是给付性 保险 ###C ： 人身保险的保险期限具有长期性 ###D ： 人身保险适用代位求偿原则 ', 'abc', '2015-11-05 14:48:16', '2015-11-05 14:48:16');
INSERT INTO `subjects` VALUES ('26', '5', '2', '下列对人身保险的特点 ， 说法正确的有 （ ） 。 ', 'A ： 投保人所交纳的保费 ， 最终都不会返还给被保险人或其受益人 ###B ： 人身保险具有长期 性 ， 人身保险公司可以积累大量的长期可使用资金 ， 成为 资本市场上重要的机构投资者 ###C ： 不以被保险人遭受实际损失为前提 ， 也并不考虑被保险人是 否已通过其它途 径得到补偿 ###D ： 人身保险多为长期保险 ', 'bcd', '2015-11-05 14:48:47', '2015-11-05 14:48:47');
INSERT INTO `subjects` VALUES ('27', '5', '2', '在国际上通常将 （ ） 定为 “ 第 三领域保险 ” ， 即介于寿险和财险之 间的一类保险 。 ', 'A ： 疾病保险 ###B ： 短期健康保险 ###C ： 人身意外伤害保险 ###D ： 变额年金保险', 'bc', '2015-11-05 14:49:37', '2015-11-05 14:49:37');
INSERT INTO `subjects` VALUES ('28', '5', '2', '人 寿保险公司和财产保险公司都能按规定享有经营权利的业务包括（ ） 。 ', 'A ： 疾病保险 ###B ： 普通寿险 ###C ： 人身意外伤害保险 ###D ： 短期健康保险 ', 'cd', '2015-11-05 14:50:35', '2015-11-05 14:50:35');
INSERT INTO `subjects` VALUES ('29', '5', '2', '在我国 ，理论上虽然将保险业务分为财产保险业务和人身保险业务，但在保险实践中，财产保险公司可以按规定经营（ ） 。', 'A ： 人身意外伤害保险业务###B ： 重大疾病保险业务 ###C ： 短期健康保险业务 ###D ： 分红保险业务 ', 'ac', '2015-11-05 14:51:08', '2015-11-05 14:51:08');
INSERT INTO `subjects` VALUES ('30', '5', '2', '下列关于人身保险保险利益特殊性的说法中 ， 不正确的是 （ ） 。 ', 'A ： 只有当投保人对被 保险人的寿命或身体具有某种利害关系时 ， 才对被保险人 具有保险利益 ###B ： 要求投保人对受益 人的寿命或身体具有某种利害关系 ###C ： 无论何时 ， 都要考虑被保险人对受益人有无保险利益 ###D ： 需考虑保险利益的金额不应超过保险标 的的实际价值 ', 'bcd', '2015-11-05 14:51:35', '2015-11-05 14:51:35');
INSERT INTO `subjects` VALUES ('31', '5', '3', '人身保险作为一种社会保障手段 ， 不能直接作用于作为社会单元的家 庭 ， 只能针对个人 。 （ ）', '', '0', '2015-11-05 14:52:21', '2015-11-05 14:52:21');
INSERT INTO `subjects` VALUES ('32', '5', '3', '当人身保险以人的身体作为保险标的时 ， 此时的保险标的是指人的生 存或者死亡 。 （ ）', '', '0', '2015-11-05 14:53:00', '2015-11-05 14:53:00');
INSERT INTO `subjects` VALUES ('33', '5', '3', '只要购买了人身保险合同 ， 那么在被保险人生存到合同期满时 ， 保险 人一定会给付保险金 。 （ ） ', '', '0', '2015-11-05 14:53:30', '2015-11-05 14:53:30');
INSERT INTO `subjects` VALUES ('34', '5', '3', '人身保险的被保险人发生保险事故后 ， 有可能不能领取保险金 。 （ ）', '', '1', '2015-11-05 14:53:54', '2015-11-05 14:53:54');
INSERT INTO `subjects` VALUES ('35', '5', '3', '尽管人身保险属于定额保险 ， 但仍需以被保险人遭受实际损失为前提 。 没有实际损失则不能得到赔付 。 （ ）', '', '0', '2015-11-05 14:54:15', '2015-11-05 14:54:15');
INSERT INTO `subjects` VALUES ('36', '5', '3', '人身保险强调的是在投保时 ， 投保人对被保险人一定要具有保险利益 。 而保险事故发生时不一定要具有保险利益 。 （ ）', '', '1', '2015-11-05 14:54:41', '2015-11-05 14:54:41');
INSERT INTO `subjects` VALUES ('37', '5', '3', '由于人身保险的长期性 ， 保险公司可以积累大量的长期可使用资金 ， 成为资本市场上重要的机构投资者 。 （ ）', '', '1', '2015-11-05 14:54:59', '2015-11-05 14:54:59');
INSERT INTO `subjects` VALUES ('38', '5', '3', '在国际 上通常将介于寿险和财险之间的一类保险定义为 “ 第二领域保 险 ” 。 （ ）', '', '0', '2015-11-05 14:55:25', '2015-11-05 14:55:25');
INSERT INTO `subjects` VALUES ('39', '5', '3', '在我国 ，理论上将保险业务分为财产保险业务和人身保险业务 。因此在保险实践中 ，财产保险公司不能经营短期健康保险 。（ ）', '', '0', '2015-11-05 14:55:43', '2015-11-05 14:55:43');
INSERT INTO `subjects` VALUES ('40', '5', '3', '在我国 ， 财产保险公司可以按规定经营人身意外伤害保险 。 （ ）', '', '1', '2015-11-05 14:56:03', '2015-11-05 14:56:03');
INSERT INTO `subjects` VALUES ('41', '5', '3', '从保险定价上看 ， 人身保险的保险金额一般是保险人在人身保险精算 原理设计的基础上 ， 综合考虑被保险人的实际需要程度和投保人实际交费 能力的 情况确定的金额 ， 保险人据此固定金额承担保险责任 。 （ ）', '', '1', '2015-11-05 14:56:20', '2015-11-05 14:56:20');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(50) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `role_id` int(20) unsigned DEFAULT '0' COMMENT '角色ID',
  `type` tinyint(2) unsigned DEFAULT '0' COMMENT '0:普通，1:vip, ',
  `balance` varchar(20) DEFAULT '0' COMMENT '余额',
  `weixin` varchar(50) DEFAULT NULL COMMENT '微信账号',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('2', 'admin', '$2y$10$UU67IFhWxqqJKZip0lyfR.cuK3hntB/Ybul2wlZTzTCMikAL1AbFS', '1', null, null, null, '2015-11-02 16:12:15', '2015-11-02 16:12:15');
